#ifndef VAR_H
#define VAR_H

const char* var[] = {
    "<p style=\" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;\">Спроектувати привод шнека змішувача мінеральних добрив за приведеною схемою. Потужність P<span style=\" vertical-align:sub;\">IV</span> на валу шнека, кутова швидкість ω його обертання і строк служби L<span style=\" vertical-align:sub;\">h</span> редуктора приведені в табл. 1, тип передачі редуктора і деталі для робочих креслень – в табл. 2.</p>"
};

const char* table1Var[][11] = {
    //var 1
    {"P(IV), кВт",     "3,6",    "4,2",    "5,0",    "3,8",     "6,0",    "6,3",    "3,0",    "4,6",    "5,2",    "5,0" },
    {"ω, рад/с",      "2,0",    "2,5",    "1,8",    "3,2",     "4,0",    "2,2",    "3,0",    "2,1",    "1,6",    "1,5"  },
    {"L(h), тис. год", "12",     "14",     "16",     "18",      "15",     "20",     "18",     "17",     "13",     "19"  },
    {"",               "",       "",       "",       "",        "",       "",       "",       "",       "",       ""    },
    {"",               "",       "",       "",       "",        "",       "",       "",       "",       "",       ""    },
    //var 2
    {"F(t), kH",       "2,0",    "2,5",    "3,0",    "3,5",     "4,0",    "4,5",    "3,6",    "3,8",    "4,2",    "3,2" },
    {"V, м/с",         "1,1",    "1,2",    "1,0",    "1,15",    "1,25",   "0,8",    "0,75",   "0,85",   "0,9",    "0,55"},
    {"D, м",           "0,3",    "0,4",    "0,325",  "0,275",   "0,35",   "0,275",  "0,275",  "0,325",  "0,3",    "0,4" },
    {"L(h), тис. год", "16",    "18",      "20",     "14",      "15",     "17",     "19",     "13",     "22",     "20"  },
    {"",               "",       "",       "",       "",        "",       "",       "",       "",       "",       ""    },
    //var 3
    {"F(t), kH",       "10",    "12",      "14",     "16",      "18",     "20",     "11",     "13",     "15",     "17"  },
    {"V, м/с",         "0,35",  "0,4",     "0,45",   "0,5",     "0,15",   "0,4",    "0,5",    "0,35",   "0,45",   "0,35"},
    {"р, м",           "0,125", "0,10",    "0,10",   "0,08",    "0,16",   "0,125",  "0,10",   "0,08",   "0,125",  "0,16"},
    {"z",              "12",    "10",      "13",     "11",      "9",      "10",     "12",     "14",     "10",     "9"   },
    {"L(h), тис. год", "15",    "17",      "19",     "20",      "21",     "18",     "16",     "14",     "12",     "20"  },
    //var 4
    {"F(t), kH",       "9,5",   "14",      "12",     "13,5",    "16",     "14",     "10",     "11",     "20",     "17"  },
    {"V, м/с",         "0,11",  "0,2",     "0,25",   "0,18",    "0,22",   "0,25",   "0,3",    "0,2",    "0,18",   "0,22"},
    {"р, м",           "0,16",  "0,125",   "0,10",   "0,08",    "0,10",   "0,125",  "0,10",   "0,125",  "0,16",   "0,10"},
    {"z",              "9",     "10",      "11",     "12",      "13",     "14",     "15",     "12",     "11",     "10"  },
    {"L(h), тис. год", "12",    "14",      "16",     "18",      "20",     "17",     "15",     "13",     "11",     "22"  },
    //var 5
    {"F(t), kH",       "18",    "14",      "16",     "16",      "15,6",   "10",     "12",     "19",     "15",     "21"  },
    {"V, м/с",         "0,5",   "0,7",     "0,6",    "0,45",    "0,5",    "0,6",    "0,45",   "0,32",   "0,5",    "0,4" },
    {"р, м",           "0,16",  "0,125",   "0,10",   "0,08",    "0,10",   "0,125",  "0,10",   "0,125",  "0,16",   "0,10"},
    {"z",              "10",    "11",      "12",     "9",       "10",     "11",     "12",     "15",     "14",     "12"  },
    {"L(h), тис. год", "20",    "22",      "25",     "18",      "16",     "17",     "19",     "21",     "20",     "23"  },
    //var 6
    {"F(t), kH",       "9",    "10",       "13",     "15",      "17",     "18",     "12",     "14",     "16",     "18"  },
    {"V, м/с",         "0,3",  "0,45",     "0,4",    "0,55",    "0,25",   "0,25",   "0,55",   "0,3",    "0,4",    "0,3" },
    {"р, м",           "0,1",  "0,15",     "0,15",   "0,1",     "0,2",    "0,15",   "0,15",   "0,1",    "0,15",   "0,2" },
    {"z",              "12",   "10",       "13",     "11",      "9",      "10",     "12",     "14",     "10",     "9"   },
    {"L(h), тис. год", "15",   "17",       "19",     "20",      "21",     "18",     "16",     "14",     "12",     "20"  },
    //var 7
    {"F(t), kH",       "40",   "50",       "45",     "40",      "35",     "30",     "40",     "30",     "40",     "25"  },
    {"V, м/с",         "0,15", "0,1",      "0,15",   "0,1",     "0,12",   "0,15",   "0,1",    "0,16",   "0,13",   "0,2" },
    {"р, м",           "0,10", "0,15",     "0,15",   "0,1",     "0,1",    "0,1",    "0,15",   "0,1",    "0,10",   "0,15"},
    {"z",              "9",    "10",       "11",     "12",      "13",     "9",      "10",     "11",     "12",     "13"  },
    {"L(h), тис. год", "20",   "20",       "25",     "20",      "20",     "20",     "15",     "25",     "25",     "25"  },
    //var 8
    {"F(t), kH",       "8",    "4,5",      "8,5",    "5",       "6",      "4",      "10",     "7",      "9",      "10"  },
    {"V, м/с",         "0,5",  "0,6",      "0,45",   "0,4",     "0,6",    "0,8",    "0,5",    "0,65",   "0,5",    "0,55"},
    {"р, м",           "0,08", "0,10",     "0,125",  "0,125",   "0,10",   "0,08",   "0,10",   "0,125",  "0,08",   "0,10"},
    {"z",              "8",    "10",       "9",      "11",      "12",     "10",     "11",     "12",     "9",      "8"   },
    {"L(h), тис. год", "10",   "11",       "12",     "13",      "14",     "15",     "16",     "17",     "18",     "20"  },
    //var 9
    {"F(t), kH",       "50",   "45",       "40",     "35",      "30",     "25",     "36",     "24",     "35",     "20"  },
    {"V, м/с",         "0,1",  "0,15",     "0,13",   "0,15",    "0,25",   "0,25",   "0,12",   "0,22",   "0,15",   "0,22"},
    {"р, м",           "0,10", "0,125",    "0,10",   "0,08",    "0,10",   "0,08",   "0,125",  "0,08",   "0,10",   "0,125"},
    {"z",              "9",    "10",       "11",     "12",      "13",     "9",      "10",     "11",     "12",     "13"  },
    {"L(h), тис. год", "20",   "22",       "25",     "24",      "23",     "18",     "15",     "26",     "20",     "27"  },
    //var 10
    {"P(IV), кВт",     "3,1",    "4,2",    "3,3",    "2,4",     "3,6",    "4,7",    "4,8",    "3,9",    "4,0",    "3,0" },
    {"ω, рад/с",      "2,0",    "2,5",    "3,0",    "4,0",     "3,2",    "2,0",    "2,5",    "3,0",    "1,5",    "2,0" },
    {"L(h), тис. год", "20",     "24" ,    "26",     "23",      "22",     "21",     "25",     "18",     "17",     "16"  },
    {"",               "",       "",       "",       "",        "",       "",       "",       "",       "",       ""    },
    {"",               "",       "",       "",       "",        "",       "",       "",       "",       "",       ""    }
};
const char* table2Var[][11] = {
    //var 1
    {"0; 4; 8",    "Косозуба",                         "Вал вхідний, колесо зубчасте ведуче, шків ведений"},
    {"1; 5; 9",    "Прямозуба",                        "Вал вихідний, колесо зубчасте, шків ведучий"},
    {"2; 6",       "Косозуба",                         "Вал вхідний, колесо зубчасте, кришка підшипника"},
    {"3; 7",       "Прямозуба",                        "Вал вихідний, колесо зубчасте, шків ведучий"},
    //var 2
    {"0; 4; 8",    "",                                 "Вал вхідний, колесо зубчасте, стакан підшипника"},
    {"1; 5; 9",    "",                                 "Вал вхідний, колесо зубчасте, кришка підшипника"},
    {"2; 6",       "",                                 "Вал вихідний, колесо зубчасте, шків ведучий"},
    {"3; 7",       "",                                 "Вал вхідний, колесо зубчасте, шків ведений"},
    //var 3
    {"0; 4; 8",    "",                                 "Вал вхідний, колесо зубчасте, шків ведений"},
    {"1; 5; 9",    "",                                 "Вал проміжний, колесо зубчасте, кришка підшипника"},
    {"2; 6",       "",                                 "Вал вихідний, колесо зубчасте, кришка підшипника"},
    {"3; 7",       "",                                 "Вал вхідний, колесо зубчасте, кришка підшипника"},
    //var 4
    {"0; 4; 8",    "З нижнім розміщенням черв’яка",    "Вал черв’ячного колеса, колесо черв’ячне, кришка підшипника"},
    {"1; 5; 9",    "З верхнім розміщенням черв’яка",   "Вал черв’яка, кришка підшипника, шків ведений"},
    {"2; 6",       "З нижнім розміщенням черв’яка",    "Вал черв’яка, кришка підшипника, колесо зубчасте"},
    {"3; 7",       "З верхнім розміщенням черв’яка",   "Вал черв’яка, кришка підшипника, колесо зубчасте"},
    //var 5
    {"0; 4; 8",    "Прямозуба",                        "Вал вхідний, колесо зубчасте, шків ведений"},
    {"1; 5; 9",    "Косозуба",                         "Вал вихідний, колесо зубчасте, кришка підшипника"},
    {"2; 6",       "Прямозуба",                        "Вал вихідний, колесо зубчасте, кришка підшипника"},
    {"3; 7",       "Косозуба",                         "Вал вхідний, колесо зубчасте, шків ведучий"},
    //var 6
    {"0; 4; 8",    "Косозуба",                         "Вал вхідний, колесо зубчасте, шків ведений"},
    {"1; 5; 9",    "Прямозуба",                        "Вал вихідний, колесо зубчасте, кришка підшипника"},
    {"2; 6",       "Косозуба",                         "Вал вхідний, колесо зубчасте, шків ведучий"},
    {"3; 7",       "Прямозуба",                        "Вал вихідний, колесо зубчасте, кришка підшипника"},
    //var 7
    {"0; 4; 8",    "З нижнім розміщенням черв’яка",    "Вал черв’ячного колеса, черв’ячне колесо, кришка підшипника"},
    {"1; 5; 9",    "З верхнім розміщенням черв’яка",   "Вал черв’яка, шків ведений, кришка підшипника"},
    {"2; 6",       "З нижнім розміщенням черв’яка",    "Вал черв’яка, шків ведучий кришка підшипника"},
    {"3; 7",       "З верхнім розміщенням черв’яка",   "Вал черв’ячного колеса, колесо черв’ячне, шків ведений"},
    //var 8
    {"0; 4; 8",    "",                                 "Вал вхідний, колесо зубчасте, шків ведучий"},
    {"1; 5; 9",    "",                                 "Вал вихідний, колесо зубчасте, зірочка ведуча"},
    {"2; 6",       "",                                 "Вал вхідний, колесо зубчасте, кришка підшипника"},
    {"3; 7",       "",                                 "Вал вихідний, колесо зубчасте, кришка підшипника"},
    //var 9
    {"0; 4; 8",    "З верхнім розміщенням черв’яка",   "Вал черв’яка, шків ведений, кришка підшипника"},
    {"1; 5; 9",    "З нижнім розміщенням черв’яка",    "Вал черв’ячного колеса, черв’ячне колесо, кришка підшипника"},
    {"2; 6",       "З нижнім розміщенням черв’яка",    "Вал черв’яка, шків ведучий кришка підшипника"},
    {"3; 7",       "З верхнім розміщенням черв’яка",   "Вал черв’ячного колеса, колесо черв’ячне, шків ведений"},
    //var 10
    {"0; 4; 8",    "Косозуба",                         "Вал вхідний, колесо зубчасте ведуче, шків ведений"},
    {"1; 5; 9",    "Прямозуба",                        "Вал вихідний, колесо конічне ведуче, кришка підшипника"},
    {"2; 6",       "Косозуба",                         "Вал вихідний, колесо зубчасте ведене, шків ведений"},
    {"3; 7",       "Прямозуба",                        "Вал вхідний, колесо зубчасте, шків ведучий"},
};


#endif // VAR_H
